tap "oven-sh/bun"

# Bootstrap and dotfiles
brew "chezmoi"
brew "git"
brew "gh"
brew "mas"

# Shell and CLI basics
brew "antidote"
# brew "atuin"
brew "bat"
brew "fd"
brew "fzf"
brew "jq"
brew "mise"
# brew "neovim"
brew "ripgrep"
brew "starship"
brew "tree"
brew "uv"
brew "curl"
brew "wget"
brew "zoxide"
brew "unar"        # 解压命令行兜底，专门应对老旧、冷门、编码混乱的压缩包

# Developer/runtime tools
brew "go"
brew "oven-sh/bun/bun"
# brew "llmfit"
# brew "hf"

# Media/document utilities that are repeatedly useful
# brew "exiftool"
brew "ffmpeg"
# brew "pandoc"
# brew "webp"
brew "yt-dlp"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-noto-sans-cjk-sc"
cask "font-noto-sans-cjk-tc"

# Core GUI tools
cask "ghostty"
cask "git-credential-manager"
cask "google-chrome"
cask "karabiner-elements"
cask "obsidian"
# cask "orbstack"
# cask "raycast"
cask "rectangle"
cask "visual-studio-code"

# Favorite casks
# cask "iina"
# cask "localsend"
cask "stats"
# cask "wechat"
cask "qlmarkdown"
# cask "squirrel-app"
cask "telegram"
# cask "tencent-lemon"
# cask "tencent-meeting"
# cask "netnewswire"      # reeder 替代品，现代 RSS reader
cask "keka"              # the-unarchiver 替代品，现代解压压缩工具
