tap "oven-sh/bun"

# Bootstrap and dotfiles
brew "chezmoi"
brew "git"
brew "gh"
brew "mas"

# Shell and CLI basics
brew "antidote"
brew "atuin"
brew "bat"
brew "fd"
brew "fzf"
brew "jq"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tree"
brew "uv"
brew "wget"
brew "zoxide"

# Developer/runtime tools
brew "go"
brew "oven-sh/bun/bun"
brew "pkgconf"

# Media/document utilities that are repeatedly useful
brew "cairo"
brew "exiftool"
brew "ffmpeg"
brew "pandoc"
brew "webp"
brew "yt-dlp"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-noto-sans-cjk-sc"
cask "font-noto-sans-cjk-tc"

# Core GUI tools
cask "ghostty"
cask "git-credential-manager"
cask "google-chrome"
cask "karabiner-elements"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "rectangle"
cask "visual-studio-code"

