#
# .zsh_plugins.txt - antidote plugins file
#

#
# Zephyr
#

# mattmc3/zephyr path:plugins/helper
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/zfunctions
# mattmc3/zephyr path:plugins/homebrew
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/compstyle
mattmc3/zephyr path:plugins/completion
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/confd
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/prompt
# mattmc3/zephyr path:plugins/directory
# mattmc3/zephyr path:plugins/macos
# mattmc3/zephyr path:plugins/utility


#
# Hooks
#

# zsh-hooks/zsh-hooks

#
# Completions
#

# mattmc3/ez-compinit
# zsh-users/zsh-completions kind:fpath path:src

#
# Editor
#

# jeffreytse/zsh-vi-mode
# romkatv/zsh-no-ps2

#
# Prompts
#

# sindresorhus/pure kind:fpath
# miekg/lean kind:fpath
romkatv/powerlevel10k

#
# OMZ
#

# using:ohmyzsh/ohmyzsh path:plugins pin:76ffd9e22acc7f11ca501f03d6999adbdb9baa61

# Clipboard
# ohmyzsh/ohmyzsh path:lib/clipboard.zsh pin:76ffd9e22acc7f11ca501f03d6999adbdb9baa61
# copypath
# copybuffer
# copyfile

# Misc
# direnv
# extract


#
# Utils
#

# larkery/zsh-histdb pre:init_histdb
# romkatv/zsh-bench kind:path
# aloxaf/fzf-tab
# mattmc3/zman

#
# Final
#
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting

# zsh-users/zsh-syntax-highlighting
# zsh-users/zsh-history-substring-search post:bindkey-hss
